src/Enums/кфкСобытияРегистрации/кфкСобытияРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>кфкСобытияРегистрации</name>
  <enumValues>
    <name>ПриЗаписи</name>
  </enumValues>
  <enumValues>
    <name>Программно</name>
  </enumValues>
  <enumValues>
    <name>Принудительно</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/кфкИнтеграция/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

// @strict-types
#Область ПрограммныйИнтерфейс

#Область РегистрацияКОбмену

// Отключает регистрацию по объекту.
// 
// Параметры:
//  Источник - СправочникОбъект, ДокументОбъект, ПланВидовХарактеристикОбъект, ПланВидовРасчетаОбъект, ПланСчетовОбъект, БизнесПроцессОбъект, ЗадачаОбъект, ПланОбменаОбъект - Объект, подлежащий выгрузке;
//			 - РегистрСведенийНаборЗаписей, РегистрНакопленияНаборЗаписей, РегистрБухгалтерииНаборЗаписей, РегистрРасчетаНаборЗаписей - Набор записей регистра, подлежащий выгрузке;
Процедура Отключить(Источник) Экспорт
	
	Источник.ДополнительныеСвойства.Вставить("кфкПропуститьРегистрацию", Истина);
	
КонецПроцедуры

// Помещает данные в очередь исходящих сообщений.
// 
// Параметры:
//  Источник - ЛюбаяСсылка - Ссылка на объект, подлежащий выгрузке;
//  		 - СправочникОбъект, ДокументОбъект, ПланВидовХарактеристикОбъект, ПланВидовРасчетаОбъект, ПланСчетовОбъект, БизнесПроцессОбъект, ЗадачаОбъект, ПланОбменаОбъект - Объект, подлежащий выгрузке;
//			 - РегистрСведенийНаборЗаписей, РегистрНакопленияНаборЗаписей, РегистрБухгалтерииНаборЗаписей, РегистрРасчетаНаборЗаписей - Набор записей регистра, подлежащий выгрузке;
//			 - Структура, Соответствие Из Произвольный - произвольное сообщение
//			 - Структура - Описание сообщения, см. ПараметрыСообщения(): 
//			 	* Данные - Строка, ДвоичныеДанные, Структура - Тело сообщения;
//				* Ключ - Строка - Уникальный идентификатор сообщения;
//			 	* Заголовки - Соответствие Из КлючИЗначение - Заголовки сообщения:
//			 		** Ключ - Строка - Имя заголовка;
//			 		** Значение - Строка - Значение заголовка;
//			 - Массив Из ЛюбаяСсылка, СправочникОбъект, ДокументОбъект, Структура - Список объектов или сообщения, подлежащих выгрузке;
//	ТипОбъект - Строка - Тип объект, подлежащий выгрузке;
//	Продюсеры - Неопределено, СправочникСсылка.кфкПродюсеры - Ссылка на продюсер
Процедура ПоместитьВОчередьИсходящих(Источник, ТипОбъект = "", Продюсеры = Неопределено) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("кфкИспользоватьИнтеграцию") Тогда
		Возврат;
	КонецЕсли;
		
	ПакетныйРежимЗаписи = ТипЗнч(Источник) = Тип("Массив");
	ПараметрыРегистрации = кфкОбработкаСобытийСлужебный.ПараметрыРегистрации(Продюсеры, ПакетныйРежимЗаписи);
	СобытиеРегистрации = Перечисления.кфкСобытияРегистрации.Программно;
	
	Если ПакетныйРежимЗаписи Тогда
		
		Счетчик = 0;
		МаксРазмерПорции = кфкОбработкаСобытийСлужебный.МаксРазмерПорцииРегистрации();
		
		Для Каждого Элемент Из Источник Цикл
			Счетчик = Счетчик + 1;
			
			кфкОбработкаСобытийСлужебный.ПоместитьВОчередьИсходящих(Элемент, СобытиеРегистрации, ТипОбъект, Ложь, ПараметрыРегистрации);
			
			Если Счетчик >= МаксРазмерПорции Тогда // порционная запись
				Счетчик = 0;
				кфкОбработкаСобытийСлужебный.ЗавершитьРегистрацию(ПараметрыРегистрации, Истина);
			КонецЕсли;
			
		КонецЦикла;
		
		кфкОбработкаСобытийСлужебный.ЗавершитьРегистрацию(ПараметрыРегистрации);
		
	Иначе
		кфкОбработкаСобытийСлужебный.ПоместитьВОчередьИсходящих(Источник, СобытиеРегистрации, ТипОбъект, Ложь, ПараметрыРегистрации);
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает уникальный ключ объекта, который используется в исходящих сообщениях для идентификации объекта.
// 
// Параметры:
//	Данные - ЛюбаяСсылка, СправочникОбъект, ДокументОбъект, РегистрСведенийКлючЗаписи, РегистрНакопленияКлючЗаписи - Данные для регистрации.
// 
// Возвращаемое значение:
//	Неопределено, Строка - Ключ объекта
//
Функция КлючОбъекта(Данные) Экспорт
	
	Возврат кфкОбработкаСобытийСлужебный.КлючОбъекта(Данные, Истина);
	
КонецФункции

// Возвращает ключи записей исходящих сообщений для данных.
// 
// Параметры:
//  Данные - ЛюбаяСсылка, СправочникОбъект, ДокументОбъект, РегистрСведенийКлючЗаписи - Данные для регистрации.
// 
// Возвращаемое значение:
//  Неопределено, Массив Из Строка - Ключи записей исходящих сообщений
Функция КлючЗаписиИсходящихСообщений(Данные) Экспорт
	
	Возврат кфкОбработкаСобытийСлужебный.КлючЗаписиИсходящихСообщений(Данные);
	
КонецФункции

#Область СобытияРегистрации

// Это регистрация при записи.
// 
// Параметры:
//	Свойства - Структура - Свойства сообщения:
//	 * СобытиеРегистрации - ПеречислениеСсылка.кфкСобытияРегистрации - Событие регистрации
// 
// Возвращаемое значение:
//  Булево - Это регистрация при записи
Функция ЭтоРегистрацияПриЗаписи(Свойства) Экспорт
	
	Событие = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Свойства, "СобытиеРегистрации");
	Если Событие = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Не указано событие регистрации!'");
	КонецЕсли;
	
	Возврат Событие = Перечисления.кфкСобытияРегистрации.ПриЗаписи;
	
КонецФункции

// Это регистрация программно.
// 
// Параметры:
//	Свойства - Структура - Свойства сообщения:
//	 * СобытиеРегистрации - ПеречислениеСсылка.кфкСобытияРегистрации - Событие регистрации
// 
// Возвращаемое значение:
//  Булево - Это регистрация программно
Функция ЭтоРегистрацияПрограммно(Свойства) Экспорт
	
	Событие = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Свойства, "СобытиеРегистрации");
	Если Событие = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Не указано событие регистрации!'");
	КонецЕсли;
	
	Возврат Событие = Перечисления.кфкСобытияРегистрации.Программно;
	
КонецФункции

// Это регистрация принудительно.
// 
// Параметры:
//	Свойства - Структура - Свойства сообщения:
//	 * СобытиеРегистрации - ПеречислениеСсылка.кфкСобытияРегистрации - Событие регистрации
// 
// Возвращаемое значение:
//  Булево - Это регистрация принудительно
Функция ЭтоРегистрацияПринудительно(Свойства) Экспорт
	
	Событие = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Свойства, "СобытиеРегистрации");
	Если Событие = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Не указано событие регистрации!'");
	КонецЕсли;
	
	Возврат Событие = Перечисления.кфкСобытияРегистрации.Принудительно;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область KafkaAPI

#Область ПубликацияСообщений

// Отправляет данные на указанный продюсер.
//	Поведение в асинхронном режиме:
//		1. При исключении: Успешно = Ложь, ТекстОшибки = <текст ошибки>;
//		2. При передаче без подтверждения: Успешно = Ложь, ТекстОшибки = <причина отсутствия подтверждения>;
//		3. При подтверждённой передаче: Успешно = Истина.
// 
// Параметры:
//  Продюсер - СправочникСсылка.кфкПродюсеры - Экземпляра продюсер
//  ИмяТопика - Строка - Имя топика
//  Сообщение - Структура - Описание сообщения, см. ПараметрыСообщения():
//		* Данные - Строка, ДвоичныеДанные, Структура - Тело сообщения;
//		* Ключ - Строка - Уникальный идентификатор сообщения;
//		* Заголовки - Соответствие Из КлючИЗначение - Заголовки сообщения:
//			** Ключ - Строка - Имя заголовка;
//			** Значение - Строка - Значение заголовка;
//		* Успешно - Булево - Признак успешной отправки. Добавляется автоматически, см. РезультатИнтеграции(); 
//		* ТекстОшибки - Строка - Текст ошибки исключительной ситуации. Добавляется автоматически, см. РезультатИнтеграции().
//	Партиция - Число - Номер партиции. Если не указан, используется -1 (автоматический выбор).
//	Сессии - Неопределено - При вызове создаётся новое подключение.
//							После завершения операции соединение автоматически закрывается.
//							Подходит для одноразовых вызовов, но менее эффективно при большом потоке сообщений.
//		   - Соответствие Из ОбработкаОбъект.кфкИнтеграция - Используется ранее созданное подключение.
//							Если объект передаётся впервые, подключение создаётся автоматически и остаётся открытым для последующих вызовов.
//							Для завершения работы соединения необходимо явным образом вызвать метод Закрыть().
//							Подходит для пакетной/массовой отправки сообщений.
// 
// Возвращаемое значение:
//  Структура - Результат отправки сообщения, см. РезультатИнтеграции():
// * Успешно - Булево - Признак успешной отправки всех сообщений.
// * ТекстОшибки - Строка - Текст общих ошибок
Функция Отправить(Продюсер, ИмяТопика, Сообщение, Партиция = -1, Сессии = Неопределено) Экспорт
	
	Возврат кфкИнтеграцияСлужебный.Отправить(Продюсер, ИмяТопика, Сообщение, Партиция, Сессии);
		
КонецФункции

// Закрыть сессии продюсера
// 
// Параметры:
//  Сессии - Соответствие Из ОбработкаОбъект.кфкИнтеграция - Ранее созданные подключения. см. Отправить и Прочитать
Процедура ЗакрытьСессииПродюсера(Сессии) Экспорт
	
	кфкИнтеграцияСлужебный.ЗакрытьСессииПродюсера(Сессии);
	
КонецПроцедуры

#КонецОбласти

#Область ЧтениеСообщений

// Читает очередь консьюмера и записывает в РегистрСведений.кфкВходящиеСообщения.
// 
// Параметры:
//	Консьюмер - СправочникСсылка.кфкКонсьюмеры - Консьюмер
//	АвтоФиксацияСмещения - Булево - Автоматически и периодически фиксировать смещения в фоновом режиме.
//	Сессии - Неопределено - При вызове создаётся новое подключение.
//							После завершения операции соединение автоматически закрывается.
//							Подходит для одноразовых вызовов, но менее эффективно при большом потоке сообщений.
//		   - Соответствие Из ОбработкаОбъект.кфкИнтеграция - Используется ранее созданное подключение.
//							Если объект передаётся впервые, подключение создаётся автоматически и остаётся открытым для последующих вызовов.
//							Для завершения работы соединения необходимо явным образом вызвать метод Закрыть().
//							Подходит для пакетной/массовой отправки сообщений.
//  
// Возвращаемое значение:
//	Структура - Результат отправки сообщения, см. РезультатИнтеграции():
//	 * Успешно - Булево - Признак успешной отправки всех сообщений.
//	 * ТекстОшибки - Строка - Текст общих ошибок
//	 * Сообщение - Неопределено, Структура - Полученное сообщение:
//		** Тело - Строка, ДвоичныеДанные - Данные сообщения
//		** Ключ - Строка - ключ сообщения (key)
//		** Заголовки - Массив Из Структура - массив заголовков, каждый заголовок состоит из ключа и значения (key, value)
//		** Топик - Строка - Имя топика.
//		** ВременнаяМетка - Число - Фактическое время записи сообщения в топик и указанный раздел.
//		** Раздел - Число - Номер партиции.
//		** Смещение - Число - Текущее смещение сообщения (offset).
Функция Прочитать(Консьюмер, АвтоФиксацияСмещения, Сессии = Неопределено) Экспорт
	
	Возврат кфкИнтеграцияСлужебный.Прочитать(Консьюмер, АвтоФиксацияСмещения, Сессии);
	
КонецФункции

// Закрыть сессии консьюмера
// 
// Параметры:
//	Сессии - Соответствие Из ОбработкаОбъект.кфкИнтеграция - Ранее созданные подключения. см. Отправить и Прочитать
Процедура ЗакрытьСессииКонсьюмера(Сессии) Экспорт
	
	кфкИнтеграцияСлужебный.ЗакрытьСессииКонсьюмера(Сессии);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Конструкторы

// Конструктор описания сообщения.
// 
// Параметры:
//	Данные - Строка, ДвоичныеДанные, Структура, Массив Из Структура  - Тело сообщения
//	Ключ - Строка - Ключ сообщения
//  
// Возвращаемое значение:
//	Структура - Параметры сообщения:
//	 * Данные - Строка, ДвоичныеДанные, Структура, Массив Из Структура - Тело сообщения
//	 * Ключ - Строка - Уникальный идентификатор сообщения
//	 * Заголовки - Соответствие Из КлючИЗначение - Заголовки сообщения:
//	  ** Ключ - Строка - Имя заголовка
//	  ** Значение - Строка - Значение заголовка
//
Функция ПараметрыСообщения(Данные = "", Ключ = "") Экспорт
	
	Результат = Новый Структура;
	
	// Служебный ключ, признак конструктора сообщения, см. кфкОбработкаСобытийСлужебный.ПоместитьВОчередьИсходящих
	Результат.Вставить(кфкОбработкаСобытийСлужебный.КлючКонструктораСообщения(), Истина);
	
	Результат.Вставить("Данные", Данные);
	Результат.Вставить("Ключ", Ключ);
	Результат.Вставить("Заголовки", Новый Соответствие);
	
	//@skip-check constructor-function-return-section
	Возврат Результат;
	
КонецФункции

// Новый результат интеграции.
// 
// Возвращаемое значение:
//  Структура - Новый результат интеграции:
// * Успешно - Булево - Успешная операция
// * ТекстОшибки - Строка - Текст ошибки операции
Функция РезультатИнтеграции() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Успешно", Ложь);
	Результат.Вставить("ТекстОшибки", "");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти
